{
    "id": 1913,
    "age_ratings": [
        "Sixteen",
        "T"
    ],
    "aggregated_rating": 74.2,
    "aggregated_rating_count": 5,
    "alternative_names": [
        "ロスト プラネット エクストリーム コンディション",
        "Rosuto Puranetto Ekusutorīmu Kondishon"
    ],
    "category": "Main Game",
    "created_at": "2013-02-03 14:47:21",
    "external_games": [
        "Lost Planet: Extreme Condition"
    ],
    "first_release_date": "2006-12-21 00:00:00",
    "game_engines": [
        "MT Framework"
    ],
    "game_modes": [
        "Single player",
        "Multiplayer"
    ],
    "genres": [
        "Shooter",
        "Platform",
        "Adventure"
    ],
    "keywords": [
        "aliens",
        "post-apocalyptic",
        "mech",
        "achievements",
        "online",
        "season winter",
        "snow",
        "amnesia",
        "over the shoulder",
        "xbox controller support for pc"
    ],
    "name": "Lost Planet: Extreme Condition",
    "platforms": [
        "PC (Microsoft Windows)",
        "PlayStation 3",
        "Xbox 360"
    ],
    "player_perspectives": [
        "Third person"
    ],
    "rating": 70.39457849195536,
    "rating_count": 95,
    "release_dates": [
        "Dec 21, 2006",
        "Jan 12, 2007",
        "Jun 26, 2007",
        "Jun 29, 2007",
        "Feb 27, 2008",
        "Feb 29, 2008",
        "Feb 26, 2008",
        "Feb 21, 2008"
    ],
    "similar_games": [
        "Bulletstorm",
        "Gears of War",
        "Rogue Warrior",
        "Syndicate",
        "Rust",
        "Inversion",
        "Death Stranding",
        "Metro Exodus",
        "Immortal: Unchained",
        "Remnant: From the Ashes"
    ],
    "slug": "lost-planet-extreme-condition",
    "storyline": "Lost Planet takes place in the year known in the game as T.C. -80 on the fictional planet of E.D.N. III. After the Earth's conditions become too hostile for humans due to war, global warming and pollution, a fictional interstellar megacorporation named Neo-Venus Construction (NEVEC) plans to colonize E.D.N. III, a new Earth-like planet in grip of a brutal ice age. NEVEC discover that E.D.N. III is inhabited by an aggressive and territorial insectoid alien species named the Akrid, which come in all shapes and sizes and generate their own precious thermal energy. 150 years after a great war was fought in which the humans lost to the Akrid, the plot of the game revolves around Wayne Holden, a soldier who attempts to overthrow NEVEC, who still vie for control over E.D.N. III, and help colonization efforts for the remainder of the human race by destroying the Akrid, all the while attempting to survive both betrayals and the extreme conditions of the planet.\n\nThe game starts with Wayne, his father Gale, and their unit taking on a mission to kill a giant Akrid known as Green Eye. During their mission, Wayne is separated from his squad and watches his father's VS explode. Wayne is left drifting in the snow and is frozen solid for 30 years. Wayne wakes up and finds himself in the care of Yuri Solotov and his crew of snow pirates; Luka and Rick. Apart from his name and the Green Eye, Wayne remembers nothing of his previous life. Yuri is particularly interested in the thermal extension (or Harmonizer) attached to Wayne's arm, which has enabled Wayne to survive all this time. Yuri tells Wayne that NEVEC is working on a project designed to thaw out the planet to make it safe to live on. Wayne joins Yuri's band, and while on a mission to wipe out an Akrid hive, fights a woman named Basil. Basil tells him that Yuri has killed her husband and that she was looking for revenge. At the same time, Yuri mysteriously disappears, leaving Wayne to question his loyalty. With the help of Rick and Luka, Wayne discovers the Green Eye's location and destroys it with Gale's (his fathers) VS. Shortly after, Wayne and his VS are attacked by NEVEC's field commander, Bandero. Slowly, after escaping the attack, Wayne remembers that rather Green Eye being responsible for killing Gale, it was actually a few NEVEC soldiers with Bendero watching. Wayne and Luka barely escape, only to find that their pirate fortress (trailer) has been sieged, and that Rick has been taken captive.\n\nFor the next year, Wayne and Luka initiate hit and run attacks against NEVEC, which has taken control over the human race. During one of their attacks, they discover Rick is still alive due to him being rescued by Basil. Basil and Wayne take a NEVEC trooper named Joe hostage. It is after taking Joe prisoner that Basil goes on to explain that the Harmonizer slows down the aging process and unlocks the powers to Gale's VS. After they interrogate him, they find out more about NEVEC's Frontier Project. Joe tells them it is NEVEC's plan to make E.D.N. III a safe place to live for humans. After joining the snow pirates, Joe arranges for Wayne to meet with NEVEC leadership, inadvertently leading to an ambush where Bandero shoots Wayne in the leg. During the confrontation, Wayne and Joe learn that the project will use T-ENG to wipe out not only all Akrid but also kill all humans left on the surface while all of NEVEC watches safely from the sky. Horrified, the pirates go on a final mission to stop the project. Wayne confronts Bandero a final time, killing him and regaining his father's rebuilt VS. Wayne finds Yuri and before dying from torture, Yuri gives Wayne an attachment to his Harmonizer as it would allow him to unlock the true power of his VS.\n\nWhile Wayne begins his attack on NEVEC's honcho, Commander Isenberg, Basil sacrifices herself to buy him time and Joe sets off explosives to destroy the elevator from which NEVEC would hide. Wayne confronts Isenberg and after fighting in VSs, shoots him in the head with a single pistol bullet right before he passes out, losing his memory again. Wayne wakes up to find Luka and Rick starting to melt all of the ice and snow from the planet, and slowly colonization begins once more.",
    "summary": "The game is played through a third person over-the-shoulder view. Players are allowed to switch between first person and third person at any moment. Players either travel on foot or ride various types of mechanized suits called Vital Suits (VSs). VSs carry heavy weapons such as chainguns and rocket launchers. They can pick up weapons lying on the ground and fire multiple weapons at once. On foot, players are able to use a grappling hook to pull themselves up to normally hard-to-reach places, or to hook onto a VS and hijack it. Driving VSs and using certain weapons requires thermal energy. Also, the planet's cold temperature causes the characters' thermal energy level to continually decrease. Players can replenish their thermal energy level by defeating enemies or activating data posts. Data posts also allow players to use their navigational radars to see incoming enemies. Each of the 11 levels is accompanied by a boss, which can be either a VS or a large Akrid.",
    "themes": [
        "Action",
        "Science fiction",
        "Survival"
    ],
    "total_rating": 72.29728924597768,
    "total_rating_count": 100,
    "updated_at": "2025-02-27 02:33:20",
    "url": "https://www.igdb.com/games/lost-planet-extreme-condition",
    "checksum": "5596fca9-163c-236b-b656-c2963e376cd8",
    "expanded_games": [
        27861
    ],
    "language_supports": [
        "English",
        "English",
        "English",
        "French",
        "French",
        "German",
        "German",
        "Italian",
        "Italian",
        "Spanish (Spain)"
    ],
    "collections": [
        356
    ],
    "game_type": "Unknown",
    "franchises": [],
    "developers": [
        "Capcom",
        "K2 LLC"
    ],
    "publishers": [
        "Capcom"
    ]
}